---
kind: property
id: P:Autodesk.Revit.DB.LinkNode.SymbolId
source: html/b12f6f45-a9c7-792c-cc45-2ecea09ad38f.htm
---
# Autodesk.Revit.DB.LinkNode.SymbolId Property

Identifies the Id of the symbol associated with the node.

## Syntax (C#)
```csharp
public ElementId SymbolId { get; }
```